Table of Contents
 Class ColumnDataEc2
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Column data Ec2
public class ColumnDataEc2 : ColumnData
Inheritance
object
ColumnData
ColumnDataEc2
Inherited Members
 ColumnData.ImperfectionsInput
 ColumnData.SecondOrderEffectInput
 ColumnData.CalculateY
 ColumnData.CalculateZ
 ColumnData.L
 ColumnData.EffectiveLength
 ColumnData.L0Y
 ColumnData.L0Z
 ColumnData.FemLenghtFromFlexibleSupport
 ColumnData.FemL0Y
 ColumnData.FemL0Z
 ColumnData.SupportTopY
 ColumnData.SupportTopZ
 ColumnData.SupportBottomY
 ColumnData.SupportBottomZ
 ColumnData.ImperfectionDirection
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ColumnDataEc2()
Constructor
public ColumnDataEc2()
Properties
 BracedY
Braced structure Y-Y
public bool BracedY { get; set; }
Property Value
bool
 BracedZ
Braced structure Z-Z
public bool BracedZ { get; set; }
Property Value
bool
 Calculation2ndOrderEffect
Use calculation of 2nd order effect
public bool Calculation2ndOrderEffect { get; set; }
Property Value
bool
 EffectConsidered
Effect considered
public EffectConsideredType EffectConsidered { get; set; }
Property Value
EffectConsideredType
 GeometricImperfectionsSLS
Use calculation geometric imperfections for SLS
public bool GeometricImperfectionsSLS { get; set; }
Property Value
bool
 GeometricImperfectionsULS
Use calculation geometric imperfections for ULS
public bool GeometricImperfectionsULS { get; set; }
Property Value
bool
 NumberOfVerticalMembersY
Gets or sets the number of vertical member in Y direction.
public int NumberOfVerticalMembersY { get; set; }
Property Value
int
 NumberOfVerticalMembersZ
Gets or sets the number of vertical member in Z direction.
public int NumberOfVerticalMembersZ { get; set; }
Property Value
int
 SecondOrderEffectMethod
Type of calculation method of 2nd order effect
public SecondOrderEffectMethodEc2 SecondOrderEffectMethod { get; set; }
Property Value
SecondOrderEffectMethodEc2
 TotalL
Gets or sets the total length of building
public double TotalL { get; set; }
Property Value
double
 UserValuec0Y
c0 user value - for nominal stiffness
public double UserValuec0Y { get; set; }
Property Value
double
 UserValuec0Z
c0 user value - for nominal stiffness
public double UserValuec0Z { get; set; }
Property Value
double
 UserValuecY
c user value - for nominal stiffness
public double UserValuecY { get; set; }
Property Value
double
 UserValuecZ
c user value - for nominal stiffness
public double UserValuecZ { get; set; }
Property Value
double
 ValueTypeOfc0Y
Type of c0 value
public ValueTypec0 ValueTypeOfc0Y { get; set; }
Property Value
ValueTypec0
 ValueTypeOfc0Z
Type of c0 value
public ValueTypec0 ValueTypeOfc0Z { get; set; }
Property Value
ValueTypec0
 ValueTypeOfcY
Type of c value - for nominal curvature
public ValueTypec ValueTypeOfcY { get; set; }
Property Value
ValueTypec
 ValueTypeOfcZ
Type of c value - for nominal curvature
public ValueTypec ValueTypeOfcZ { get; set; }
Property Value
ValueTypec
 Edit this page